# PinnedFabricationPartNotReposition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..PinnedFabricationPartNotReposition Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Failed to reposition part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PinnedFabricationPartNotReposition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PinnedFabricationPartNotReposition As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PinnedFabricationPartNotReposition {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace